Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Камальдинов Дмитрий Тальмирович");

ИмяПрофиляНазначения = "Инженер-конструктор 3 категории";


ПрофильНазначения = Справочники.ПрофилиГруппДоступа.НайтиПоНаименованию(ИмяПрофиляНазначения);
Если ПрофильНазначения = Неопределено Или ПрофильНазначения.Пустая() Тогда
	Сообщить("Аул не найден: " + ИмяПрофиляНазначения);
	Возврат;
КонецЕсли;

Если Пользователь = Неопределено Или Пользователь.Пустая() Тогда
	Сообщить("Грузин не найден: " + ИмяПрофиляНазначения);
	Возврат;
КонецЕсли;


Запрос = Новый Запрос;
Запрос.Текст =
"ВЫБРАТЬ РАЗЛИЧНЫЕ
|   ГД.Ссылка КАК ГруппаДоступа,
|   ПРЕДСТАВЛЕНИЕ(ГД.Ссылка) КАК ГруппаДоступаПредставление,
|   ГД.Профиль КАК Профиль,
|   ПРЕДСТАВЛЕНИЕ(ГД.Профиль) КАК ПрофильПредставление
|ИЗ
|   Справочник.ГруппыДоступа КАК ГД
|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.Пользователи КАК Участники
|   ПО Участники.Ссылка = ГД.Ссылка
|ГДЕ
|   НЕ ГД.ПометкаУдаления
|   И (
|       ГД.Пользователь = &Пользователь
|
|       ИЛИ Участники.Пользователь = &Пользователь
|
|       ИЛИ ГД.Пользователь В (
|           ВЫБРАТЬ Составы.ГруппаПользователей
|           ИЗ РегистрСведений.СоставыГруппПользователей КАК Составы
|           ГДЕ Составы.Пользователь = &Пользователь
|               И Составы.Используется
|       )
|       ИЛИ Участники.Пользователь В (
|           ВЫБРАТЬ Составы.ГруппаПользователей
|           ИЗ РегистрСведений.СоставыГруппПользователей КАК Составы
|           ГДЕ Составы.Пользователь.Наименование = &Пользователь
|               И Составы.Используется
|       )
|   )";

Запрос.УстановитьПараметр("Пользователь", Пользователь.Наименование);

ТабПрофилей = Запрос.Выполнить().Выгрузить();
Сообщить("Найдено связок (ГД-Профиль): " + ТабПрофилей.Количество());

Для каждого СтрП Из ТабПрофилей Цикл
    Сообщить(СтрП.ПрофильПредставление + "  (ГД: " + СтрП.ГруппаДоступаПредставление + ")");
КонецЦикла;

РолиУник = Новый Массив;

Для каждого СтрП Из ТабПрофилей Цикл
    Если Не ЗначениеЗаполнено(СтрП.Профиль) Тогда
        Продолжить;
    КонецЕсли;

    ПрофОбъект = СтрП.Профиль.ПолучитьОбъект();
    Для каждого СтрРоль Из ПрофОбъект.Роли Цикл
        Если ЗначениеЗаполнено(СтрРоль.Роль) Тогда
            РолиУник.Добавить(СтрРоль.Роль);
        КонецЕсли;
    КонецЦикла;
КонецЦикла;



ОбъектПрофиля = ПрофильНазначения.ПолучитьОбъект();

Для каждого РольИзПрофиля Из РолиУник Цикл
	// Сообщить(РольИзПрофиля);
	Нов = ОбъектПрофиля.Роли.Добавить();
	Нов.Роль = РольИзПрофиля;
КонецЦикла;


ОбъектПрофиля.Записать();
Сообщить("В профиле '" + ИмяПрофиляНазначения + "' теперь ролей: " + ОбъектПрофиля.Роли.Количество());
