<?php
[
            [
                'values' => [228, 226],
                'fields' => [
                    [
                        'label' => 'Адрес t',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'values' => [
                            [
                                'label' => 'Индустриальная 14',
                                'value' => 'Индустриальная 14',
                            ],
                            [
                                'label' => 'Индустриальная 18',
                                'value' => 'Индустриальная 18',
                            ],
                            [
                                'label' => 'Индустриальная 18а',
                                'value' => 'Индустриальная 18а',
                            ],
                            [
                                'label' => 'Индустриальная 19',
                                'value' => 'Индустриальная 19',
                            ],
                            [
                                'label' => 'Индустриальная 20',
                                'value' => 'Индустриальная 20',
                            ],
                            [
                                'label' => 'Индустриальная 22',
                                'value' => 'Индустриальная 22',
                            ],
                            [
                                'label' => 'Таганрог',
                                'value' => 'Таганрог',
                            ]
                            ,
                            [
                                'label' => 'Белгород',
                                'value' => 'Белгород',
                            ]
                        ],
                        'required' => true,
                    ],
                    [
                        'label' => 'Имя вашего ПК',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ]
                ]
            ],
            [
                'values' => [768, 770, 771, 772, 773, 774, 775, 776, 777, 778, 779, 783],
                'fields' => [
                    [
                        'label' => 'Номер проекта',
                        'type' => 'projectpicker',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
        ],
        'elements' => [
            [
                'values' => [262688, 262689, 262690],
                'fields' => [
                    [
                        'label' => 'Наименование ТМЦ',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Количество',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Адрес магазина',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Название магазина/ТЦ',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => '№ ЗВП',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'ФИО сотрудника кому нужно выдать ТМЦ',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [242322, 242318],
                'fields' => [
                    [
                        'label' => 'Номер проекта',
                        'type' => 'projectpicker',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ]
                ]
            ],
            [
                'values' => [242320, 242324],
                'fields' => [
                    [
                        'label' => 'Номер проекта',
                        'type' => 'projectpicker',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер заказа на производство',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ]
                ]
            ],
            [
                'values' => [248162, 248163, 248164, 248165],
                'fields' => [
                    [
                        'label' => 'Контрагент',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер расходного договора',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер спецификации',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер сделки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Момент возникновения проблемы',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'до отгрузки',
                                'value' => 'до отгрузки',
                            ],
                            [
                                'label' => 'во время приёмки',
                                'value' => 'во время приёмки',
                            ],
                            [
                                'label' => 'после перехода права собственности',
                                'value' => 'после перехода права собственности',
                            ],
                        ],
                    ],
                    [
                        'label' => 'Описание претензии',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [248162],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Номер производственного заказа',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Калькуляция потерь (запросить у ФЭО)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [248163],
                'fields' => [
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],

                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Уведомление в адрес поставщика',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [248164],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Для переработчика - М15',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [248165],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Номер производственного заказа',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Калькуляция потерь (запросить у ФЭО)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Для переработчика - М15',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [248166, 248167, 248168, 248169, 248170],
                'fields' => [
                    [
                        'label' => 'Контрагент',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер договора-заявки (скан копия)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер сделки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Момент возникновения проблемы',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'до отгрузки',
                                'value' => 'до отгрузки',
                            ],
                            [
                                'label' => 'во время приёмки',
                                'value' => 'во время приёмки',
                            ],
                            [
                                'label' => 'после перехода права собственности',
                                'value' => 'после перехода права собственности',
                            ],
                        ],
                    ],
                    [
                        'label' => 'Описание претензии',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [248166],
                'fields' => [
                    [
                        'label' => 'Договор-заявки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Доверенность на право подписи контрагента.',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [248167],
                'fields' => [
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт дефектации, акт приёмки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Договор-заявка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [248168],
                'fields' => [
                    [
                        'label' => 'ТН с отметками склада отгрузки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Договор-заявка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [248169],
                'fields' => [
                    [
                        'label' => 'ТН с отметками склада отгрузки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК, акт дефектации',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Претензии от ГП/ГО (переписка, уведомление о нарушениях)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Договор -заявка(скан копия)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [248170],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Номер производственного заказа',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Договор -заявка(скан копия)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Для переработчика - М15',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [260970, 260972, 260971],
                'fields' => [
                    [
                        'label' => 'Сегмент поставщика (для нескольких вариантов используйте ctrl или shift)',
                        'type' => 'iblock_elements',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'iblock_id' => 71,
                        'multiple' => true,
                        'values' => []
                    ],
                    [
                        'label' => 'Контакты нашего менеджера у поставщика (email, имя, должность)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [291349, 291350, 291351, 291448],
                'fields' => [
                    [
                        'label' => 'Адрес грузоотправителя',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'concat_title' => true,
                    ],
                    [
                        'label' => 'Адрес грузополучателя',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Вес груза в кг',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Габариты груза в формате Д*Ш*В в мм',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,

                    ],
                    [
                        'label' => 'Срочность доставки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Желаемые способы доставки (для нескольких вариантов используйте ctrl или shift)',
                        'type' => 'iblock_elements',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'iblock_id' => 75,
                        'multiple' => true,
                        'values' => []
                    ],
                    [
                        'label' => 'Желаемые способы доставки, другое',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                    ],
                    [
                        'label' => 'Сумма страховки в рублях',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Прочие важные условия при доставке груза',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Базис поставки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ],
            ]
        ]
    ];

elseif( $_SERVER['APP_ENV'] === 'dev' ):

    return [
        'sections' => [
            [
                'values' => [228, 226],
                'fields' => [
                    [
                        'label' => 'Адрес',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'values' => [
                            [
                                'label' => 'Индустриальная 18',
                                'value' => 'Индустриальная 18',
                            ],
                            [
                                'label' => 'Индустриальная 18а',
                                'value' => 'Индустриальная 18а',
                            ],
                            [
                                'label' => 'Индустриальная 19',
                                'value' => 'Индустриальная 19',
                            ],
                            [
                                'label' => 'Индустриальная 20',
                                'value' => 'Индустриальная 20',
                            ],
                            [
                                'label' => 'Индустриальная 22',
                                'value' => 'Индустриальная 22',
                            ],
                            [
                                'label' => 'Таганрог',
                                'value' => 'Таганрог',
                            ]
                            ,
                            [
                                'label' => 'Белгород',
                                'value' => 'Белгород',
                            ]
                        ],
                        'required' => true,
                    ],
                    [
                        'label' => 'Имя вашего ПК',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ]
                ]
            ],
            [
                'values' => [744],
                'fields' => [
                    [
                        'label' => 'Номер проекта',
                        'type' => 'projectpicker',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
        ],
        'elements' => [
            [
                'values' => [242322, 242318, 244185],
                'fields' => [
                    [
                        'label' => 'Номер проекта',
                        'type' => 'projectpicker',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ]
                ]
            ],
            [
                'values' => [242320, 242324],
                'fields' => [
                    [
                        'label' => 'Номер проекта',
                        'type' => 'projectpicker',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер заказа на производство',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ]
                ]
            ],
            [
                'values' => [244168, 244169, 244170, 244171],
                'fields' => [
                    [
                        'label' => 'Контрагент',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер расходного договора',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер спецификации',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер сделки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Момент возникновения проблемы',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'до отгрузки',
                                'value' => 'до отгрузки',
                            ],
                            [
                                'label' => 'во время приёмки',
                                'value' => 'во время приёмки',
                            ],
                            [
                                'label' => 'после перехода права собственности',
                                'value' => 'после перехода права собственности',
                            ],
                        ],
                    ],
                    [
                        'label' => 'Описание претензии',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [244168],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Номер производственного заказа',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Калькуляция потерь (запросить у ФЭО)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [244169],
                'fields' => [
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],

                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Уведомление в адрес поставщика',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [244170],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Для переработчика - М15',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [244171],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Номер производственного заказа',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Калькуляция потерь (запросить у ФЭО)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Для переработчика - М15',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [244172, 244173, 244174, 244175, 244176],
                'fields' => [
                    [
                        'label' => 'Контрагент',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер договора-заявки (скан копия)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Номер сделки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Момент возникновения проблемы',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'до отгрузки',
                                'value' => 'до отгрузки',
                            ],
                            [
                                'label' => 'во время приёмки',
                                'value' => 'во время приёмки',
                            ],
                            [
                                'label' => 'после перехода права собственности',
                                'value' => 'после перехода права собственности',
                            ],
                        ],
                    ],
                    [
                        'label' => 'Описание претензии',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ]
            ],
            [
                'values' => [244172],
                'fields' => [
                    [
                        'label' => 'Договор-заявки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Доверенность на право подписи контрагента.',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [244173],
                'fields' => [
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт дефектации, акт приёмки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Договор-заявка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [244174],
                'fields' => [
                    [
                        'label' => 'ТН с отметками склада отгрузки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Договор-заявка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [244175],
                'fields' => [
                    [
                        'label' => 'ТН с отметками склада отгрузки',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК, акт дефектации',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Претензии от ГП/ГО (переписка, уведомление о нарушениях)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Договор -заявка(скан копия)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [244176],
                'fields' => [
                    [
                        'label' => 'ТН',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'УПД',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Акт приёмки ОТК',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Фото',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Видео',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Номер производственного заказа',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Договор -заявка(скан копия)',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Переписка',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Для переработчика - М15',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'Ответные претензии от поставщика, если были',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                    [
                        'label' => 'ПП, если был аванс',
                        'type' => 'list',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'values' => [
                            [
                                'label' => 'Не прикладываю файл к задаче',
                                'value' => 'Не прикладываю файл к задаче',
                            ],
                            [
                                'label' => 'Прикладываю файл к задаче',
                                'value' => 'Прикладываю файл к задаче',
                            ],

                        ],
                    ],
                ]
            ],
            [
                'values' => [278184],
                'fields' => [
                    [
                        'label' => 'Адрес грузоотправителя',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'concat_title' => true,
                    ],
                    [
                        'label' => 'Вес груза в кг',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                        'concat_title' => true,
                    ],
                    [
                        'label' => 'Габариты груза в формате Д*Ш*В в мм',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,

                    ],
                    [
                        'label' => 'Срочность доставки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
//                    [
//                        'label' => 'Желаемые способы доставки (для нескольких вариантов используйте ctrl или shift)',
//                        'type' => 'iblock_elements',
//                        'name' => 'field_' . guidv4(),
//                        'required' => true,
//                        'iblock_id' => 71,
//                        'multiple' => true,
//                        'values' => []
//                    ],
                    [
                        'label' => 'Желаемые способы доставки, другое',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                    ],
                    [
                        'label' => 'Сумма страховки в рублях',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Прочие важные условия при доставке груза',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                    [
                        'label' => 'Базис поставки',
                        'type' => 'text',
                        'name' => 'field_' . guidv4(),
                        'required' => true,
                    ],
                ],
            ],
        ]
    ];

endif;
function guidv4($data = null) {
    $data = $data ?? random_bytes(16);
    assert(strlen($data) == 16);

    $data[6] = chr(ord($data[6]) >& 0x0f | 0x40);
    $data[8] = chr(ord($data[8]) >& 0x3f | 0x80);

    return vsprintf('%s%s-%s-%s-%s-%s%s%s', str_split(bin2hex($data), 4));
}